/*
Задание №6 (доп)
Реализовать функцию возведения числа а в степень b.
Сводя количество выполняемых действий к минимуму.
Пример 1: а = 3, b = 2, ответ: 9
Пример 2: а = 2, b = -2, ответ: 0.25
Пример 3: а = 3, b = 0, ответ: 1
 */
public class TaskJava6 {
    public static void main(String[] args) {
        double degree = Math.pow(3, 2);
        System.out.println(degree);
    }
}
